
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьКонтрагентаДоговор(Команда)
	ПрочитатьКонтрагентаДоговорНаСервере(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьGUID(Команда)
	// Володин А.А. 
	// Задача 1 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	//Попытка
	//	ВременнаяПеременная = Новый УникальныйИдентификатор(GUID);
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "GUID корректный";
	//	Сообщение.Сообщить();
	//Исключение
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "GUID ошибочный";
	//	Сообщение.Сообщить();
	//КонецПопытки;
	
	Результат = СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(GUID);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(?(Результат, "GUID корректный", "GUID ошибочный"));
	
	// Конец вставки от 16 августа 2024 г.
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьТекущегоПользователя(Команда)

	// Володин А.А. 
	// Задача 1 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	
	//СообщитьТекущегоПользователяНаСервере();
	
	ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекущийПользователь);
	
	// Конец вставки от 16 августа 2024 г.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайтНетологии(Команда)
	// Володин А.А. 
	// Задача 1 ДЗ Программный интерфейс  
	// 16 августа 2024 г.
	//ЗапуститьПриложение("https://netology.ru");
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://netology.ru");
	// Конец вставки от 16 августа 2024 г.
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТяжелуюОперацию(Команда)
	// Володин А.А. 
	// Задача 2 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	//ВыполнитьТяжелуюОперациюНаСервере();
	ДлительнаяОперация = ВыполнитьТяжелуюОперациюНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
	// Конец вставки от 16 августа 2024 г.
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПрочитатьКонтрагентаДоговорНаСервере(Заказ)
	// Володин А.А. 
	// Задача 1 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	//               |	ЗаказПокупателя.Договор КАК Договор
	//               |ИЗ
	//               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	//               |ГДЕ
	//               |	ЗаказПокупателя.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Заказ);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Выборка.Следующий();
	//
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = СтрШаблон("%1, %2", Выборка.Контрагент, Выборка.Договор);
	//Сообщение.Сообщить();
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ, "Контрагент,Договор");
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1, %2", Результат.Контрагент, Результат.Договор));
			
	// Конец вставки от 16 августа 2024 г.
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьТекущегоПользователяНаСервере()
	// Володин А.А. 
	// Задача 1 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	//
	//ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Пользователи.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.Пользователи КАК Пользователи
	//               |ГДЕ
	//               |	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	//Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Выборка.Следующий();
	//
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.КлючДанных = Выборка.Ссылка;
	//Сообщение.Текст = Выборка.Ссылка;
	//Сообщение.Сообщить();
	//
	// Конец вставки от 16 августа 2024 г.
КонецПроцедуры

// Володин А.А. 
// Задача 2 ДЗ Программный интерфейс 
// 16 августа 2024 г.
//&НаСервереБезКонтекста
&НаСервере
//Процедура ВыполнитьТяжелуюОперациюНаСервере()
Функция ВыполнитьТяжелуюОперациюНаСервере()
// Конец вставки от 16 августа 2024 г.	
	// Володин А.А. 
	// Задача 2 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	
	//Результат = Обработки.ДЗ_12_2_АлгоритмыДляРефакторинга.ТяжелаяОперация();
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ДЗ_12_2_АлгоритмыДляРефакторинга.ТяжелаяОперация");  
    
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = СтрШаблон("Результат тяжелой операции: %1", Результат);
	//Сообщение.Сообщить();
	
	Возврат Результат; 
	// Конец вставки от 16 августа 2024 г.

// Володин А.А. 
// Задача 2 ДЗ Программный интерфейс 
// 16 августа 2024 г.
//КонецПроцедуры
КонецФункции
// Конец вставки от 16 августа 2024 г.

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	// Володин А.А. 
	// Задача 2 ДЗ Программный интерфейс 
	// 16 августа 2024 г.
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Результат тяжелой операции: %1", ПолучитьИзВременногоХранилища(Результат.АдресРезультата)));		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
			
	КонецЕсли;
		
	// Конец вставки от 16 августа 2024 г.
	
КонецПроцедуры

#КонецОбласти
